planet_app/app/controllers/planets_controller.rb

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @planet = Planet.find(params[:id])

INSERT INTO "planets" ("name", "distance_from_sun", "diameter", "orbit_period", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "georgette"], ["distance_from_sun", "sadf"], ["diameter", "dafsdasd"], ["orbit_period", "dafs"], ["created_at", "2019-04-03 11:05:05.435231"], ["updated_at", "2019-04-03 11:05:05.435231"]]
---
  def create
    @planet = Planet.new(planet_params)
    if @planet.save

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "planets" SET "distance_from_sun" = $1, "updated_at" = $2 WHERE "planets"."id" = $3  [["distance_from_sun", "11"], ["updated_at", "2019-04-13 21:16:23.756702"], ["id", 1]]
---
  def update
    @planet = Planet.find(params[:id])
    if @planet.update(planet_params)

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = $1  [["id", 2]]
---
  def destroy
    @planet = Planet.find(params[:id])
    @planet.destroy